Autodesk.Revit.DB.SolidUtils.GetBoundingBox(Autodesk.Revit.DB.Solid)
Retrieves a box that circumscribes the solid geometry.
geom:
The solid geometry.
Returns:
The bounding box.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014